# Multi-value columns (optional)
In this Notebook, you will compare how to access and update data stored in a single-value column 
(*normalised data*) with the same data stored in a multi-value column (*unnormalised data*). You will use the following three different representations of movie genres:

- `movie_genre` table (Movies dataset)

movie_id | genre
---------|------
1 | Adventure
1 | Animation
1 | Children
1 | Comedy
1 | Fantasy

- `movie_genres_array` table - movie genres stored as 
SQL [`ARRAY`](http://www.postgresql.org/docs/9.3/static/arrays.html) elements.

movie_id | genre
---------|------
1 | ['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy']

- `movie_genres_list` table - movie genres stored as a 'pipe' ('|') separated list.

movie_id | genre
---------|------
1 | 'Adventure&#124;Animation&#124;Children&#124;Comedy&#124;Fantasy'

Enable access to the PostgreSQL database engine via [SQL Cell Magic](https://pypi.python.org/pypi/ipython-sql).

In [1]:
%load_ext sql
%sql postgresql://test:test@localhost:5432/tm351test

'Connected: test@tm351test'

In [2]:
%%sql
DROP TABLE IF EXISTS movie_genre CASCADE;

CREATE TABLE movie_genre (
 movie_id INTEGER NOT NULL,
 genre VARCHAR(20) NOT NULL,
 PRIMARY KEY (movie_id, genre)
);

DROP TABLE IF EXISTS movie_genres_array CASCADE;

CREATE TABLE movie_genres_array (
 movie_id INTEGER NOT NULL,
 genres VARCHAR(20)[] NOT NULL,
 PRIMARY KEY (movie_id)
);

DROP TABLE IF EXISTS movie_genres_list CASCADE;

CREATE TABLE movie_genres_list (
 movie_id INTEGER NOT NULL,
 genres VARCHAR(100) NOT NULL,
 PRIMARY KEY (movie_id)
);

Done.
Done.
Done.
Done.
Done.
Done.

[]

Populate the tables from files using [Psycopg](http://initd.org/psycopg/docs/index.html), 
a PostgreSQL database adapter for Python.

In [3]:
import psycopg2 as pg
import pandas as pd
import pandas.io.sql as psqlg

In [4]:
# open a connection to the PostgreSQL database tm351test
conn = pg.connect(dbname='tm351test', host='localhost', user='test', password='test', port=5432)
# create a cursor
c = conn.cursor()

# open movie_genre.dat
io = open('data/movie_genre.dat', 'r')
# execute the PostgreSQL copy command
c.copy_from(io, 'movie_genre')
# close movie_genre.dat'
io.close()
# commit transaction
conn.commit()

# open movie_genres_array.dat
io = open('data/movie_genres_array.dat', 'r')
# execute the PostgreSQL copy command
c.copy_from(io, 'movie_genres_array')
# close movie_genres_array.dat'
io.close()
# commit transaction
conn.commit()

# open movie_genres_list.dat
io = open('data/movie_genres_list.dat', 'r')
# execute the PostgreSQL copy command
c.copy_from(io, 'movie_genres_list')
# close movie_genres_list.dat'
io.close()
# commit transaction
conn.commit()

# close cursor
c.close()
# close database connection
conn.close()

- `movie_genre` table (Movies dataset)

In [5]:
%%sql
SELECT * 
FROM movie_genre
WHERE movie_id = 1;

5 rows affected.

[(1, 'Adventure'),
 (1, 'Animation'),
 (1, 'Children'),
 (1, 'Comedy'),
 (1, 'Fantasy')]

- `movie_genres_array` table - movie genres stored as 
SQL [`ARRAY`](http://www.postgresql.org/docs/9.3/static/arrays.html) elements.

In [6]:
%%sql
SELECT * 
FROM movie_genres_array
WHERE movie_id = 1;

1 rows affected.

[(1, ['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy'])]

- `movie_genres_list` table - movie genres stored as a 'pipe' ('|') separated list.

In [7]:
%%sql
SELECT * 
FROM movie_genres_list
WHERE movie_id = 1;

1 rows affected.

[(1, 'Adventure|Animation|Children|Comedy|Fantasy')]

## Searching the data

To illustrate how to search the data stored in the three different representations of movie genres, let's determine 
the number of 'horror' movies recorded in the Movies dataset.

- `movie_genre` table (Movies dataset)

In [8]:
%%sql
SELECT COUNT(*) AS number_of_horror_movies
FROM movie_genre
WHERE genre = 'Horror'

1 rows affected.

[(1013,)]

- `movie_genres_array` table - movie genres stored as 
SQL [`ARRAY`](http://www.postgresql.org/docs/9.3/static/arrays.html) elements.

In [9]:
%%sql
SELECT COUNT(*) AS number_of_horror_movies
FROM movie_genres_array
WHERE 'Horror' = ANY(genres);

1 rows affected.

[(1013,)]

Notes:

The result of [`ANY`](http://www.postgresql.org/docs/9.3/static/functions-comparisons.html) is *true* if any array 
element matches the supplied string.

- `movie_genres_list` table - movie genres stored as a 'pipe' ('|') separated list.

In [10]:
%%sql
SELECT COUNT(*) AS number_of_horror_movies
FROM movie_genres_list
WHERE genres LIKE '%Horror%';

1 rows affected.

[(1013,)]

Notes:
    
The [`LIKE`](http://www.postgresql.org/docs/9.3/static/functions-matching.html) expression returns *true* if the 
column value matches the supplied pattern where `%` matches any sequence of zero or more characters.

## Extracting the data

To illustrate how to extract the data stored in the three different representations of movie genres, let's determine 
the number of movies classified under each genre.

- `movie_genre` table (Movies dataset)

In [11]:
%%sql
SELECT genre, COUNT(*) AS number_of_movies
FROM movie_genre
GROUP BY genre
ORDER BY genre;

20 rows affected.

[('Action', 1473),
 ('Adventure', 1025),
 ('Animation', 286),
 ('Children', 528),
 ('Comedy', 3703),
 ('Crime', 1118),
 ('Documentary', 482),
 ('Drama', 5339),
 ('Fantasy', 543),
 ('Film-Noir', 148),
 ('Horror', 1013),
 ('IMAX', 29),
 ('Musical', 436),
 ('Mystery', 509),
 ('(no genres listed)', 1),
 ('Romance', 1685),
 ('Sci-Fi', 754),
 ('Thriller', 1706),
 ('War', 511),
 ('Western', 275)]

- `movie_genres_array` table - movie genres stored as 
SQL [`ARRAY`](http://www.postgresql.org/docs/9.3/static/arrays.html) elements.

In [12]:
%%sql
SELECT genre, COUNT(*) AS number_of_movies
FROM (SELECT movie_id, UNNEST(genres) AS genre
      FROM movie_genres_array) AS unnested
GROUP BY genre
ORDER BY genre;

20 rows affected.

[('Action', 1473),
 ('Adventure', 1025),
 ('Animation', 286),
 ('Children', 528),
 ('Comedy', 3703),
 ('Crime', 1118),
 ('Documentary', 482),
 ('Drama', 5339),
 ('Fantasy', 543),
 ('Film-Noir', 148),
 ('Horror', 1013),
 ('IMAX', 29),
 ('Musical', 436),
 ('Mystery', 509),
 ('(no genres listed)', 1),
 ('Romance', 1685),
 ('Sci-Fi', 754),
 ('Thriller', 1706),
 ('War', 511),
 ('Western', 275)]

Notes:

The [`UNNEST`](http://www.postgresql.org/docs/9.3/static/functions-array.html#ARRAY-FUNCTIONS-TABLE) function 
expands an array into a set of rows as illustrated by the following `SELECT` statement.

In [13]:
%%sql
SELECT movie_id, UNNEST(genres) AS genre
FROM movie_genres_array
WHERE movie_id = 1;

5 rows affected.

[(1, 'Adventure'),
 (1, 'Animation'),
 (1, 'Children'),
 (1, 'Comedy'),
 (1, 'Fantasy')]

Notes:
    
The resultant table of the execution of the 

`SELECT movie_id, UNNEST(genres) AS genre FROM movie_genres_array` 

statement is identical to the `movie_genre` table as illustrated by the following statements. You will learn about nested `SELECT` statements (SQL subqueries) in Part 11.

In [14]:
movie_genre = %sql \
 SELECT * \
 FROM movie_genre \
 ORDER BY movie_id, genre;

movie_genres_array_unnested = %sql \
 SELECT movie_id, UNNEST(genres) AS genre \
 FROM movie_genres_array \
 ORDER BY movie_id, genre;
    
movie_genre == movie_genres_array_unnested

21564 rows affected.
21564 rows affected.

True

- `movie_genres_list` table - movie genres stored as a 'pipe' ('|') separated list.

In [15]:
%%sql
SELECT genre, COUNT(*) AS number_of_movies
FROM (SELECT movie_id, UNNEST(STRING_TO_ARRAY(genres,'|')) AS genre
      FROM movie_genres_list) AS unnested
GROUP BY genre
ORDER BY genre;

20 rows affected.

[('Action', 1473),
 ('Adventure', 1025),
 ('Animation', 286),
 ('Children', 528),
 ('Comedy', 3703),
 ('Crime', 1118),
 ('Documentary', 482),
 ('Drama', 5339),
 ('Fantasy', 543),
 ('Film-Noir', 148),
 ('Horror', 1013),
 ('IMAX', 29),
 ('Musical', 436),
 ('Mystery', 509),
 ('(no genres listed)', 1),
 ('Romance', 1685),
 ('Sci-Fi', 754),
 ('Thriller', 1706),
 ('War', 511),
 ('Western', 275)]

Notes:

The [`STRING_TO_ARRAY`](http://www.postgresql.org/docs/9.3/static/functions-array.html#ARRAY-FUNCTIONS-TABLE) 
function unpacks the supplied string into array elements using supplied delimiter.

## Updating the data

To illustrate how to update the data stored in the three different representations of movie genres, let's suppose we 
have to replace the genre *Animation* with *Drama* for the movie identified by the `movie_id` of 1.

- `movie_genre` table (Movies dataset)

In [16]:
%%sql
UPDATE movie_genre
 SET genre = 'Drama'
 WHERE movie_id = 1 AND genre = 'Animation';
    
SELECT *
FROM movie_genre
WHERE movie_id = 1;

1 rows affected.
5 rows affected.

[(1, 'Adventure'),
 (1, 'Children'),
 (1, 'Comedy'),
 (1, 'Drama'),
 (1, 'Fantasy')]

- `movie_genres_array` table - movie genres stored as 
SQL [`ARRAY`](http://www.postgresql.org/docs/9.3/static/arrays.html) elements.

In [17]:
%%sql
UPDATE movie_genres_array
 SET genres = ARRAY_REPLACE(genres,'Animation','Drama')
 WHERE movie_id = 1;

SELECT *
FROM movie_genres_array
WHERE movie_id = 1;

1 rows affected.
1 rows affected.

[(1, ['Adventure', 'Drama', 'Children', 'Comedy', 'Fantasy'])]

Notes:
    
The [`ARRAY_REPLACE`](http://www.postgresql.org/docs/9.3/static/functions-array.html#ARRAY-FUNCTIONS-TABLE) 
function replaces each array element equal to the value supplied with a new value. Other 
[`ARRAY`](http://www.postgresql.org/docs/9.3/static/functions-array.html#ARRAY-FUNCTIONS-TABLE) functions 
are provided to add and delete elements.

- `movie_genres_list` table - movie genres stored as a 'pipe' ('|') separated list.

In [18]:
%%sql
UPDATE movie_genres_list
 SET genres = REPLACE(genres,'Animation','Drama')
 WHERE movie_id = 1;

SELECT *
FROM movie_genres_list
WHERE movie_id = 1;

1 rows affected.
1 rows affected.

[(1, 'Adventure|Drama|Children|Comedy|Fantasy')]

Notes:
    
The [`REPLACE`](http://www.postgresql.org/docs/9.3/static/functions-string.html) function replaces all occurrences 
of a substring in a string with another substring. 
Other [`STRING`](http://www.postgresql.org/docs/9.3/static/functions-string.html) functions are provided to add and 
delete substrings.

## Surrogate keys

In Exercise 10.4 we introduced *surrogate keys* as a means of identifying rows in a table when no natural identifier exists.

A *surrogate* key is typically automatically generated by the DBMS and we will illustrate how this can be 
accomplished with PostgreSQL using the example given in Exercise 10.4.

- Create and populate the unnormalised `book` table

In [19]:
%%sql
DROP TABLE IF EXISTS book CASCADE;
CREATE TABLE book (
 isbn CHAR(14) NOT NULL,
 title VARCHAR(100) NOT NULL,
 authors VARCHAR(250) NOT NULL,
 cost DECIMAL(5,2) NOT NULL,
 PRIMARY KEY (isbn)
);

Done.
Done.

[]

In [20]:
# open a connection to the PostgreSQL database tm351test
conn = pg.connect(dbname='tm351test', host='localhost', user='test', password='test', port=5432)
# create a cursor
c = conn.cursor()

# open book+authors.dat
io = open('data/book+authors.dat', 'r')
# execute the PostgreSQL copy command
c.copy_from(io, 'book')
# close book+authors.dat'
io.close()
# commit transaction
conn.commit()

# close cursor
c.close()
# close database connection
conn.close()

In [21]:
%%sql
SELECT *
FROM book
ORDER BY isbn;

7 rows affected.

[('978-0071005296', 'Database System Concepts', 'Henry F Korth, Abraham Silberschatz', Decimal('9.55')),
 ('978-0130402646', 'Database System Implementation', 'Hector Garcia-Molina, Jeffrey D Ullman, Jennifer Widom', Decimal('48.78')),
 ('978-0471141617', 'Building the Data Warehouse', 'William H Inmon', Decimal('9.55')),
 ('978-1292025827', 'A First Course in Database Systems', 'Jeffrey D Ullman, Jennifer Widom', Decimal('10.00')),
 ('978-1558604568', 'SQL:1999', 'Jim Melton, Alan R Simon', Decimal('54.99')),
 ('978-1558604896', 'Data Mining: Concepts and Techniques', 'Jiawei Han, Micheline Kamber', Decimal('18.55')),
 ('978-1852330088', 'A Guided Tour of Relational Databases', 'Mark Levene, George Loizou', Decimal('41.69'))]

- Create and populate the `author` table.

In [22]:
%%sql
DROP TABLE IF EXISTS author CASCADE;
CREATE TABLE author (
 author_id SERIAL,
 author_name VARCHAR(25) NOT NULL,
 PRIMARY KEY (author_id)
);

INSERT INTO author(author_name) 
 SELECT UNNEST(STRING_TO_ARRAY(authors,', ')) AS author_name
 FROM book
 GROUP BY author_name;

SELECT *
FROM author
ORDER BY author_id;

Done.
Done.
12 rows affected.
12 rows affected.

[(1, 'William H Inmon'),
 (2, 'Micheline Kamber'),
 (3, 'Alan R Simon'),
 (4, 'George Loizou'),
 (5, 'Jim Melton'),
 (6, 'Jeffrey D Ullman'),
 (7, 'Henry F Korth'),
 (8, 'Abraham Silberschatz'),
 (9, 'Hector Garcia-Molina'),
 (10, 'Jennifer Widom'),
 (11, 'Mark Levene'),
 (12, 'Jiawei Han')]

Notes:

As the primary key of the `author` table, `author_id`, is defined as a 
[`SERIAL`](http://www.postgresql.org/docs/9.3/static/datatype-numeric.html#DATATYPE-SERIAL) type, it will 
automatically assigned integer values from a sequence generator each time a row is added to the table.

- Create and populate the `book_authors` table.

In [23]:
%%sql
DROP TABLE IF EXISTS book_authors CASCADE;
CREATE TABLE book_authors (
 isbn CHAR(14) NOT NULL,
 author_id INTEGER NOT NULL,
 PRIMARY KEY (isbn, author_id)
);

INSERT INTO book_authors(isbn, author_id)
 SELECT isbn, author_id
 FROM (SELECT isbn, UNNEST(STRING_TO_ARRAY(authors,', ')) AS author_name FROM book) AS authors NATURAL JOIN author;

SELECT *
FROM book_authors
ORDER BY (isbn, author_id);

Done.
Done.
14 rows affected.
14 rows affected.

[('978-0071005296', 7),
 ('978-0071005296', 8),
 ('978-0130402646', 6),
 ('978-0130402646', 9),
 ('978-0130402646', 10),
 ('978-0471141617', 1),
 ('978-1292025827', 6),
 ('978-1292025827', 10),
 ('978-1558604568', 3),
 ('978-1558604568', 5),
 ('978-1558604896', 2),
 ('978-1558604896', 12),
 ('978-1852330088', 4),
 ('978-1852330088', 11)]

Notes:

The `book_authors` table is populated by matching authors' names in the `book` and `author` tables after expanding 
the `authors` array in the `author` table into a set of rows.

- Recreate the original `book` table.

In [24]:
%%sql
SELECT isbn, title, author_name, cost
FROM (book NATURAL JOIN book_authors) NATURAL JOIN author
ORDER BY isbn, author;

14 rows affected.

[('978-0071005296', 'Database System Concepts', 'Henry F Korth', Decimal('9.55')),
 ('978-0071005296', 'Database System Concepts', 'Abraham Silberschatz', Decimal('9.55')),
 ('978-0130402646', 'Database System Implementation', 'Jeffrey D Ullman', Decimal('48.78')),
 ('978-0130402646', 'Database System Implementation', 'Hector Garcia-Molina', Decimal('48.78')),
 ('978-0130402646', 'Database System Implementation', 'Jennifer Widom', Decimal('48.78')),
 ('978-0471141617', 'Building the Data Warehouse', 'William H Inmon', Decimal('9.55')),
 ('978-1292025827', 'A First Course in Database Systems', 'Jeffrey D Ullman', Decimal('10.00')),
 ('978-1292025827', 'A First Course in Database Systems', 'Jennifer Widom', Decimal('10.00')),
 ('978-1558604568', 'SQL:1999', 'Alan R Simon', Decimal('54.99')),
 ('978-1558604568', 'SQL:1999', 'Jim Melton', Decimal('54.99')),
 ('978-1558604896', 'Data Mining: Concepts and Techniques', 'Micheline Kamber', Decimal('18.55')),
 ('978-1558604896', 'Data Mining: Concepts and Techniques', 'Jiawei Han', Decimal('18.55')),
 ('978-1852330088', 'A Guided Tour of Relational Databases', 'George Loizou', Decimal('41.69')),
 ('978-1852330088', 'A Guided Tour of Relational Databases', 'Mark Levene', Decimal('41.69'))]

## Summary
In this Notebook you have compared how to access and update data stored in a single-value column (normalised data) 
with the same data stored in a multi-value column (unnormalised data). You have also seen how *surrogate keys* are 
implemented in PostgreSQL.

## What next?
If you are working through this Notebook as part of an inline exercise, return to the module materials now.

If you are working through this set of Notebooks as a whole, move on to `10.6 Referential integrity and referential actions`.